{
  "domande": ["1. Si dia la definizione di proposizione logica.",
    "2. Si dia la definizione di tautologia e contraddizione.",
    "3. Si dia la definizione di predicato.",
    "4. Si dia la definizione di sottoinsieme e di insieme delle parti.",
    "5. Si dia la definizione di unione, intersezione, differenza, differenza simmetrica, prodotto cartesiano tra insiemi.",
    "6. Si dia la definizione di Relazione.",
    "7. Si dia la definizione di Relazione simmetrica, riflessiva, transitiva, di equivalenza.",
    "8. Si dia la definizione di Partizione.",
    "9. Si descriva la partizione associata ad una relazione di equivalenza.",
    "10. Si descriva la relazione di equivalenza associata ad una partizione.",
    "11. Si dia la definizione di funzione tra due insiemi.",
    "12. Si dia la definizione di funzione iniettiva e suriettiva.",
    "13. Si dia la definizione di funzione composta.",
    "14. Si dia la definizione di funzione iniettiva identità.",
    "15. Si dia la definizione di relazione associata ad una funzione.",
    "16. Si dia la definizione di insieme quoziente associato ad una funzione.",
    "17. Si enunci il teorema di decomposizione canonica di una funzione.",
    "18. Si dia la definizione di funzione caratteristica di un insieme.",
    "19. Si enunci il Teorema sulle funzioni caratteristiche.",
    "20. Si dia la definizione di successione.",
    "21. Si dia la definizione di serie.",
    "22. Si dia la definizione di successione ricorsiva.",
    "23. Si dia la definizione di successione ricorsiva lineare omogenea.",
    "24. Si enunci il teorema per le successioni ricorsive lineari omogenee.",
    "25. Si enunci il principio di induzione.",
    "26. Si dia la definizione di disposizioni semplici.",
    "27. Si dia la definizione di permutazioni.",
    "28. Si dia la definizione di combinazioni semplici.",
    "29. Si dia la definizione di disposizioni con ripetizione.",
    "30. Si dia la definizione di combinazioni con ripetizione.",
    "31. Si dia la definizione di operazione binaria interna e delle possibili proprietà.",
    "32. Si dia la definizione di gruppo.",
    "33. Si dia la definizione di anello.",
    "34. Si dia la definizione di dominio di integrità.",
    "35. Si dia la definizione di dominio di campo.",
    "36. Si dia la definizione di MCD.",
    "37. Si dia la definizione di mcm.",
    "38. Si enunci il teorema sulla fattorizzazione dei numeri naturali.",
    "39. Si enunci il teorema sulla divisione con resto.",
    "40. Si enunci il teorema sull’algoritmo euclideo.",
    "41. Definire la relazione modulo n.",
    "42. Dati a, b ∈ Zn, definire a | b.",
    "43. Dare la definizione di 0-divisori in Zn.",
    "44. Dare la definizione di elementi invertibili in Zn.",
    "45. Quali sono gli elementi invertibili in Zn?",
    "46. Enunciare il “Sogno della Matricola”.",
    "47. Enunciare il Piccolo Teorema di Fermat.",
    "48. Si dia la definizione di funzione ϕ di Eulero.",
    "49. Enunciare il Teorema di Eulero.",
    "50. Si enunci il criterio di divisibilità modulo 3.",
    "51. Si enunci il criterio di divisibilità modulo 2^i.",
    "52. Si enunci il criterio di divisibilità modulo 5^i.",
    "53. Si enunci il criterio di divisibilità modulo 9.",
    "54. Si enunci il criterio di divisibilità modulo 11.",
    "55. Si dia la definizione di equazione diofantea.",
    "56. Si enunci il teorema sulle equazioni diofantee.",
    "57. Si enunci il teorema cinese dei resti.",
    "58. Si dia la definizione di polinomio.",
    "59. Si dia la definizione di grado di un polinomio.",
    "60. Si enunci il teorema sulla divisione tra polinomi.",
    "61. Si dia la definizione di radice di un polinomio.",
    "62. Si enunci il teorema di Ruffini.",
    "63. Si dia la definizione di polinomio riducibile e irriducibile.",
    "64. Si dia la definizione di Grafo Orientato.",
    "65. Si dia la definizione di Grafo Non Orientato.",
    "66. Si dia la definizione di Grafo Completo.",
    "67. Si dia la definizione di vertici adiacenti.",
    "68. Si dia la definizione di grado di un vertice.",
    "69. Si dia la definizione di cammino.",
    "70. Si dia la definizione di distanza tra due vertici.",
    "71. Si dia la definizione di grafo connesso.",
    "72. Si dia la definizione di componente connessa di un grafo.",
    "73. Si dia la definizione di circuito.",
    "74. Si dia la definizione di cammino e circuito euleriano.",
    "75. Si enunci il Teorema di Eulero per i grafi.",
    "76. Si dia la definizione di albero e foresta."
  ]
}